# ตัวดำเนินการเปรียบเทียบ

# นำข้อมูล 2 ค่า มาเปรียบเทียบกัน
# นำข้อมูลอย่างน้อย 2 ค่ามาเปรียบเทียย
# ชนิดข้อมูลเหมืองกัน
# คำตอบ 2 คำตอบ => จริง / เท็จ

x, y, z = 8, 7, 9

""" print("ค่า x มากกว่า y หรือไม่ ? :", x > y)
print("ค่า x น้อยกว่า y หรือไม่ ? :", x < y)
print("ค่า x มากกว่า y หรือไม่ ? :", x == y)
print("ค่า x มากกว่า y หรือไม่ ? :", x != y)

print("ค่า x มากกว่า หรือ เท่ากับ y หรือไม่ ? :", x >= y)
print("ค่า x มากกว่า หรือ เท่ากับ y หรือไม่ ? :", x <= y) """

# และ
print("ค่า x มากกว่า y และ y มากกว่า z หรือไม่ :", x > y > z)
print("ค่า x น้อยกว่า y และ y น้อยกว่า z หรือไม่ :", x < y < z)
